---
title: Redis Pentesting
description: Redis is the In-Memory Database. A default port is 6379.
tags:
    - Database
refs:
date: 2022-12-25
draft: false
---

## Enumeration

```sh
nmap --script redis-info -p 6379 <target-ip>
nmap --script redis-brute -p 6379 <target-ip>
```

### Check Config File

If we have access to target system, find the configuration file then we may be able to get passwords.

```sh
find / -name "redis.conf" 2>/dev/null
grep -i pass /path/to/redis.conf
```

If we get the line with password written as below,

```sh
requirepass "password"
```

We can set the password in a redis client.

```sh
> auth "password"
```


<br />

## Connect

```sh
redis-cli -h <target-ip> -p 6379

# with password
redis-cli -h <target-ip> -p 6379 -a password
```

<br />

## Commands

```sh
# Check credentials
> auth <username> <password>
> auth default <password>

# Set a password temporary until the service restarts.
> config set requirepass <password>

# Information on the Redis server
> info
> info keyspace

# List all databases
> config get databases

# Select the database ('select <index>')
> select 0
> select 1
> select 12
```

### Get a Key Value

First find all keys.

```sh
> keys *
```

Before getting key values, we need to determine the type of key value by “type” command.

```sh
# Get the type of value
> type <key_name>
```

When we get the type, we can get the value of the key as below.

```bash
# type: string
> get <key_name>

# type: hash
> hget <key_name>
> hmget <key_name>
> hgetall <key_name>

# type: lists
> lrange <key_name> <start> <stop>
# e.g.
> lrange "userlist" 0 0
> lrange "userlist" 0 5

# type: sets
> smembers <key_name>

# type: sorted sets
> zrangebyscore <key_name> <min> <max>

# type: stream
> xread count <count> streams <key_name> <id>
```

<br />

## Port Forwarding Redis Server to Local Machine

In local machine,

```sh
chisel server -p 9001 --reverse
```

In target machine,

```sh
./chisel client <local-ip>:9001 R:6379:127.0.0.1:6379
```