---
title: Reverse Engineering with Rizin
description: Rizin is a reverse engineering framework forked from Radare2.
tags:
    - Malware
    - Reverse Engineering
draft: false
---

### Using Cutter

Cutter is a GUI tool for reverse engineering powered by Rizin.  
It can also have a decompiler, so itâ€™s recommended to use it first.

```sh
cutter <file>
```

To use the Ghidra decompiler, install the package.

```sh
sudo apt install rizin-plugin-ghidra
```

<br />

## Start

```sh
rizin ./example

# Debug
rizin -d ./example
```

<br />

## Print Usage

```sh
# Print usage
> ?

# Add "?" suffix to print the usage of the specific command.
> i?
> p?
```

<br />

## Visual Mode

You can enter visual mode for more intuitive operation.

```sh
> v

# Visual Debugger Mode
> Vpp
```

Below is a list of basic commands:

```sh
# Toggle print mode
p
# or
P

# Step
s

# Toggle cursor mode
c

# Exit
q

# Enable regular rizin commands
:
```

<br />

## Debug

```sh
# Step
> ds
# Step 3 times
> ds 3
# Step back
> dsb

# Setup a breakpoint
> db 0x8048920
# Remove a breakpoint
> db -0x8048920
# Remove all breakpoints
> db-*
# List all breakpoints
> dbl

# Continue process execution
> dc
# Continue until syscall
> dcs

# Read all registers values
> dr
> dr=
# Read given register value
> dr eip
> dr rip
# Set a register value
> dr eax=24
```

<br />

## Seek

```sh
# Print current address
> s

# Seek to given address
> s 0x1360
> s 0x0x00001360

# Seek to register address
> s esp
> s esp+0x40
> s rsp
> s rsp+0x40

# Seek 8 positions
> sd 8

# Show the seek history
> sh
# Undoing
> shu
# Redoing
> shr
```

<br />

## Print

```sh
# Disassemble at current address
> pd
# Disassemble 10 instructions at current address
> pd 10
# Disassemble all possible opcodes at current address
> pda
# Disassemble all possible opcodes 10 instructions at current address
> pda 10

# Disassemble a function at current address
> pdf
# Disassemble at given address
> pdf @ 0x401005
# Disassemble the main function
> pdf @ main

# Show 200 hex bytes
> px 200
# Show hex bytes at given register
> px @ eip
> px @ esp
```

<br />

## Expressions

```sh
> ?vi 0x000011a4
4516

> ?vi 1+2
3
```

<br />

## Information about Binary File

```sh
# Information about the binary file
> i

# All summary
> ia

# Show main address
> iM

# Symbols
is

# List strings
> iz
# List strings in whole binary
> izz
```

<br />

## Functions

```sh
# List functions
> afl

# Show address of current function
> afo
```

